rheoTool/tutorials/rheoFoam/OtherTests/Channel2D_VE/otherModels/SaramitoLog/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{                
                type             SaramitoLog;

                rho              rho [1 -3 0 0 0 0 0] 1.;
                etaS             etaS [1 -1 -1 0 0 0 0] .01;
                etaP             etaP [1 -1 -1 0 0 0 0] .99;             
                lambda           lambda [0 0 1 0 0 0 0] .1;
       
                tau0             tau0 [1 -1 -2 0 0 0 0] 2.5;
                k                k [1 -1 -1 0 0 0 0] 1.5; // Always viscosity units to be independent from n (not the real units)      
                n                n [0 0 0 0 0 0 0] 0.75;
                zeta             zeta [0 0 0 0 0 0 0] 0.;
                
                PTTfunction      none;
                epsilon          epsilon [0 0 0 0 0 0 0] 0.;
                            
                dims             (1 1 0); // Valid geometric dimensions: 1 = valid and 0 = not valid 
               
                writeSecondInvariantTauDev true;

                stabilization    coupling;                   
}

passiveScalarProperties
{
                solvePassiveScalar   no;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
